FTC Shuts Down 4 Robocall Groups Responsible For Billions of Illegal Robocalls
If you were filthy rich, what's a totally unnecessary but cool and outrageously eccentric thing you would buy?
Lmao
If I try to rob 4 guys on spring break.
A national Australian study has found more than half of car drivers think cyclists are not completely human. The study (n=442) found a link between dehumanization and deliberate acts of aggression, with more than one in ten people having deliberately driven their car close to a cyclist.
Theresa May is under intense pressure to announce her resignation plans today
TIL that “Shots to roughly 80 percent of targets on the body would not be fatal blows” and that “if a gunshot victim’s heart is still beating upon arrival at a hospital, there is a 95 percent chance of survival”
NJ approves bill allowing terminally ill patients to end their lives
Apple's 2019 iMacs have 5400RPM, slow spinning disks in them, and are glued closed, preventing reasonable upgrades.
10 million years ago, turtles could eat you with a single bite.
Since cows have been pretty popular lately, here’s just a normal doggo.
Facebook Bans White Nationalism and White Separatism: 'Facebook will also begin directing users who try to post content associated with those ideologies to a nonprofit that helps people leave hate groups.'
All because you had to make your exit
Superhero movies are boring and I hope the fad dies soon
Here's the leaked poster for Episode IX that got removed from Twitter.
Waking up after meeting Cardi B
McConnell blocks resolution calling for release of Mueller report for second time
Everyone hates the special Olympics, right?
Youtuber makes video exposing broken game mechanics, gets globally banned by game developers (Studio Wildcard)
India becomes fourth country to destroy satellite in space
Mormon "Gay conversion therapist" comes out (2019) [Interview] - David Matheson, the American intellectual godfather of "Gay Cure Therapy" concedes the practice is harmful and comes out as gay at the age of 57. [13:17]
Hell yeah
Matched with these two girls what are the odds lmao
This decade (2010s) will be the first one to only have 2 James Bond movies in franchise history. But Daniel Craig will be the first Bond actor to appear in 3 consecutive decades.
The Vatican's all-woman magazine was censored from reporting on priests raping nuns. The entire staff of the magazine just quit in protest.
